# <center> <img src="../../labs/img/ITESOLogo.png" alt="ITESO" width="480" height="130"> </center>
# <center> **Departamento de Electrónica, Sistemas e Informática** </center>
---
### <center> **Procesamiento de Datos Masivos** </center>
---
### <center> **Primavera 2025** </center>
---
**Primer Examen**

**Fecha**: 14 de Marzo del 2025

**Nombre del estudiante**: Lorena Ruelas Gaytán

**Professor**: Pablo Camarillo Ramirez

In [1]:
import findspark
findspark.init()

In [2]:
from pyspark.sql import SparkSession

spark = SparkSession.builder \
    .appName("SparkSQL-Exam-1-LORENA-RUELAS-GAYTAN") \
    .master("spark://e3b046ba856a:7077") \
    .config("spark.ui.port","4040") \
    .getOrCreate()
sc = spark.sparkContext

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
25/03/14 13:38:48 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [5]:
from team_name.spark_utils import SparkUtils
employees_schema = SparkUtils.generate_schema([("employee_id", "integer"), ("employee_info", "string")])

employees_df = spark.read \
                .schema(employees_schema) \
                .option("header", "true") \
                .csv("/home/jovyan/notebooks/data/exam/employees.csv")

employees_df.printSchema()

employees_df.show(5, truncate=False)

root
 |-- employee_id: integer (nullable = true)
 |-- employee_info: string (nullable = true)

+-----------+-------------------------------------------------------------------------------------------+
|employee_id|employee_info                                                                              |
+-----------+-------------------------------------------------------------------------------------------+
|1          |{'name': 'Caitlyn', 'department_id': 103, 'salary': 115959.78, 'hire_date': '2002-06-10'}  |
|2          |{'name': 'Rachel', 'department_id': 104, 'salary': 100820.16, 'hire_date': '2009-07-01'}   |
|3          |{'name': 'Carrie', 'department_id': 105, 'salary': 114421.44, 'hire_date': '1998-12-10'}   |
|4          |{'name': 'Renee', 'department_id': 104, 'salary': 54688.13, 'hire_date': '1995-03-17'}     |
|5          |{'name': 'Gabriella', 'department_id': 109, 'salary': 106267.03, 'hire_date': '1995-02-09'}|
+-----------+-------------------------------------------------------------------------------------------+
only showing top 5 rows

In [6]:
from team_name.spark_utils import SparkUtils
departments_schema = SparkUtils.generate_schema([("department_id", "integer"), ("department_name", "string"), ("location", "string")])

departments_df = spark.read \
                .schema(departments_schema) \
                .option("header", "true") \
                .csv("/home/jovyan/notebooks/data/exam/departments.csv")

departments_df.printSchema()

departments_df.show(5, truncate=False)

root
 |-- department_id: integer (nullable = true)
 |-- department_name: string (nullable = true)
 |-- location: string (nullable = true)

+-------------+----------------------+---------+
|department_id|department_name       |location |
+-------------+----------------------+---------+
|101          |Human Resources       |San Diego|
|102          |Finance and Accounting|New York |
|103          |Sales and Marketing   |Chicago  |
|104          |Data Engineering      |Zapopan  |
|105          |Data Science          |Seattle  |
+-------------+----------------------+---------+
only showing top 5 rows

In [10]:
from pyspark.sql.functions import get_json_object

employees_df = employees_df.withColumn("name", get_json_object(employees_df.employee_info, "$.name")) \
                            .withColumn("department_id", get_json_object(employees_df.employee_info, '$.department_id')) \
                            .withColumn("salary", get_json_object(employees_df.employee_info, '$.salary')) \
                            .withColumn("hire_date", get_json_object(employees_df.employee_info, '$.hire_date')) \
                            .drop("employee_info")


employees_df.show(truncate=False)

+-----------+---------+-------------+---------+----------+
|employee_id|name     |department_id|salary   |hire_date |
+-----------+---------+-------------+---------+----------+
|1          |Caitlyn  |103          |115959.78|2002-06-10|
|2          |Rachel   |104          |100820.16|2009-07-01|
|3          |Carrie   |105          |114421.44|1998-12-10|
|4          |Renee    |104          |54688.13 |1995-03-17|
|5          |Gabriella|109          |106267.03|1995-02-09|
|6          |Kristen  |101          |88237.54 |2010-11-15|
|7          |Jonathan |102          |39323.42 |2012-06-30|
|8          |Michelle |101          |64262.85 |2005-10-30|
|9          |Michelle |105          |103521.88|1991-07-10|
|10         |Lisa     |110          |55435.93 |2016-03-25|
|11         |Cheryl   |103          |88073.75 |2020-08-21|
|12         |Mikayla  |107          |95192.05 |2022-05-13|
|13         |Lisa     |104          |36032.49 |2019-05-16|
|14         |Sean     |108          |64904.69 |2021-06-06|
|15         |Monica   |105          |92589.97 |2022-05-09|
|16         |Katelyn  |104          |147225.58|2008-03-14|
|17         |Linda    |108          |146632.64|2002-09-04|
|18         |Tammy    |109          |128860.4 |2014-04-18|
|19         |William  |103          |142645.41|1998-05-25|
|20         |Jorge    |109          |87587.51 |2018-03-25|
+-----------+---------+-------------+---------+----------+
only showing top 20 rows

In [11]:
exam_df = employees_df.join(departments_df, employees_df.department_id == departments_df.department_id, "inner")

exam_df.show(5, truncate=False)

+-----------+---------+-------------+---------+----------+-------------+-------------------+-------------+
|employee_id|name     |department_id|salary   |hire_date |department_id|department_name    |location     |
+-----------+---------+-------------+---------+----------+-------------+-------------------+-------------+
|1          |Caitlyn  |103          |115959.78|2002-06-10|103          |Sales and Marketing|Chicago      |
|2          |Rachel   |104          |100820.16|2009-07-01|104          |Data Engineering   |Zapopan      |
|3          |Carrie   |105          |114421.44|1998-12-10|105          |Data Science       |Seattle      |
|4          |Renee    |104          |54688.13 |1995-03-17|104          |Data Engineering   |Zapopan      |
|5          |Gabriella|109          |106267.03|1995-02-09|109          |Customer Service   |San Francisco|
+-----------+---------+-------------+---------+----------+-------------+-------------------+-------------+
only showing top 5 rows

In [12]:
from pyspark.sql.functions import when

exam_df = exam_df.withColumn('salary_category', when(exam_df['salary'] >= 55000, "High").otherwise("Low"))
exam_df.show(n=5)

+-----------+---------+-------------+---------+----------+-------------+-------------------+-------------+---------------+
|employee_id|     name|department_id|   salary| hire_date|department_id|    department_name|     location|salary_category|
+-----------+---------+-------------+---------+----------+-------------+-------------------+-------------+---------------+
|          1|  Caitlyn|          103|115959.78|2002-06-10|          103|Sales and Marketing|      Chicago|           High|
|          2|   Rachel|          104|100820.16|2009-07-01|          104|   Data Engineering|      Zapopan|           High|
|          3|   Carrie|          105|114421.44|1998-12-10|          105|       Data Science|      Seattle|           High|
|          4|    Renee|          104| 54688.13|1995-03-17|          104|   Data Engineering|      Zapopan|            Low|
|          5|Gabriella|          109|106267.03|1995-02-09|          109|   Customer Service|San Francisco|           High|
+-----------+---------+-------------+---------+----------+-------------+-------------------+-------------+---------------+
only showing top 5 rows

In [13]:
high_salary_df = exam_df.filter(exam_df["salary_category"] == "High")
low_salary_df = exam_df.filter(exam_df["salary_category"] == "Low")

high_salary_df.show(n=5)
low_salary_df.show(n=5)

+-----------+---------+-------------+---------+----------+-------------+-------------------+-------------+---------------+
|employee_id|     name|department_id|   salary| hire_date|department_id|    department_name|     location|salary_category|
+-----------+---------+-------------+---------+----------+-------------+-------------------+-------------+---------------+
|          1|  Caitlyn|          103|115959.78|2002-06-10|          103|Sales and Marketing|      Chicago|           High|
|          2|   Rachel|          104|100820.16|2009-07-01|          104|   Data Engineering|      Zapopan|           High|
|          3|   Carrie|          105|114421.44|1998-12-10|          105|       Data Science|      Seattle|           High|
|          5|Gabriella|          109|106267.03|1995-02-09|          109|   Customer Service|San Francisco|           High|
|          6|  Kristen|          101| 88237.54|2010-11-15|          101|    Human Resources|    San Diego|           High|
+-----------+---------+-------------+---------+----------+-------------+-------------------+-------------+---------------+
only showing top 5 rows

+-----------+--------+-------------+--------+----------+-------------+--------------------+-------------+---------------+
|employee_id|    name|department_id|  salary| hire_date|department_id|     department_name|     location|salary_category|
+-----------+--------+-------------+--------+----------+-------------+--------------------+-------------+---------------+
|          4|   Renee|          104|54688.13|1995-03-17|          104|    Data Engineering|      Zapopan|            Low|
|          7|Jonathan|          102|39323.42|2012-06-30|          102|Finance and Accou...|     New York|            Low|
|         13|    Lisa|          104|36032.49|2019-05-16|          104|    Data Engineering|      Zapopan|            Low|
|         26|    John|          109|44836.57|2004-11-13|          109|    Customer Service|San Francisco|            Low|
|         38|  Rachel|          109|43269.85|1992-07-13|          109|    Customer Service|San Francisco|            Low|
+-----------+--------+-------------+--------+----------+-------------+--------------------+-------------+---------------+
only showing top 5 rows

In [23]:
from pyspark.sql.functions import col

high_salary_df = high_salary_df.withColumn("salary", col("salary").cast("double"))
low_salary_df = low_salary_df.withColumn("salary", col("salary").cast("double"))


avg_high_salary_df = high_salary_df.groupBy("department_name").avg("salary").alias("avg_salary")

avg_low_salary_df = low_salary_df.groupBy("department_name").avg("salary").alias("avg_salary")

avg_high_salary_df.show(n=5)
avg_low_salary_df.show(n=5)

+--------------------+------------------+
|     department_name|       avg(salary)|
+--------------------+------------------+
|Corporate Strateg...|102741.38324414717|
| Sales and Marketing|100839.65275449108|
|    Data Engineering|101626.29492163012|
|Research and Deve...|  98714.3003086419|
|Finance and Accou...|100731.07877887784|
+--------------------+------------------+
only showing top 5 rows

+--------------------+------------------+
|     department_name|       avg(salary)|
+--------------------+------------------+
|Corporate Strateg...|41590.741833333326|
| Sales and Marketing| 41150.40277777778|
|    Data Engineering| 41358.50794117647|
|Finance and Accou...|42740.952888888874|
|Research and Deve...| 41426.43521126761|
+--------------------+------------------+
only showing top 5 rows

In [28]:
high_salary_df.createOrReplaceTempView("high_salary")

spark.sql("SELECT name, salary FROM high_salary ORDER BY salary DESC LIMIT 5").show(5)

+---------+---------+
|     name|   salary|
+---------+---------+
|Gabriella|149989.73|
|Katherine| 149979.3|
|     Ryan| 149963.1|
|  Caitlyn|149956.54|
|     Mark|149915.56|
+---------+---------+

In [29]:
low_salary_df.createOrReplaceTempView("low_salary")

spark.sql("SELECT name, salary FROM low_salary ORDER BY salary DESC LIMIT 5").show(5)

+-----+--------+
| name|  salary|
+-----+--------+
|Linda|54993.53|
|Tammy|54991.71|
|Aaron|54989.45|
|Craig| 54945.2|
|Aaron| 54937.3|
+-----+--------+

In [34]:
from pyspark.sql.functions import year

final_df = exam_df.withColumn("years_in_company", 2025 - year(col("hire_date")))

final_df.show(n=5)

+-----------+---------+-------------+---------+----------+-------------+-------------------+-------------+---------------+----------------+
|employee_id|     name|department_id|   salary| hire_date|department_id|    department_name|     location|salary_category|years_in_company|
+-----------+---------+-------------+---------+----------+-------------+-------------------+-------------+---------------+----------------+
|          1|  Caitlyn|          103|115959.78|2002-06-10|          103|Sales and Marketing|      Chicago|           High|              23|
|          2|   Rachel|          104|100820.16|2009-07-01|          104|   Data Engineering|      Zapopan|           High|              16|
|          3|   Carrie|          105|114421.44|1998-12-10|          105|       Data Science|      Seattle|           High|              27|
|          4|    Renee|          104| 54688.13|1995-03-17|          104|   Data Engineering|      Zapopan|            Low|              30|
|          5|Gabriella|          109|106267.03|1995-02-09|          109|   Customer Service|San Francisco|           High|              30|
+-----------+---------+-------------+---------+----------+-------------+-------------------+-------------+---------------+----------------+
only showing top 5 rows

In [39]:
final_df.createOrReplaceTempView("years_salary")

spark.sql("""
    SELECT employee_id, name, hire_date, years_in_company, COUNT(*) as num_employees
    FROM years_salary
    WHERE years_in_company = 37  
    GROUP BY employee_id, name, hire_date, years_in_company
    ORDER BY years_in_company DESC
""").show(5)

+-----------+-----------+----------+----------------+-------------+
|employee_id|       name| hire_date|years_in_company|num_employees|
+-----------+-----------+----------+----------------+-------------+
|       3119|       Seth|1988-04-01|              37|            1|
|        917|       Luke|1988-07-14|              37|            1|
|       2888|Christopher|1988-04-12|              37|            1|
|        597|     Rachel|1988-06-08|              37|            1|
|       1391|        Amy|1988-06-17|              37|            1|
+-----------+-----------+----------+----------------+-------------+
only showing top 5 rows

In [ ]:
sc.stop()